# 文学部のITド素人が開発チームについていくためにやったこと紹介（やった順）

## 基本情報技術者試験

とりあえず会社推奨だというのと、これまで縁のなかった「国家資格」というパワーワードにつられて勉強しました。業務独占資格ではないため特に効力はありませんが。

私は入社前から年齢のせいで焦燥感があったという理由もあって、入社してすぐ4月の試験で取得しました。

でも正直に言って、これを持っていてとても役に立った！という実感は未だほとんどありません、というか思い当たりません。いよいよ何のために取ったんだって感じですね（笑）

在学中は学部的にもその知識を使う場面はほとんどなかったせいか、試験が終わった瞬間多分ほとんど忘れてしまったのだと思います。学んだことはすぐに実践で活かさないとだめですね。

しかし、記憶のプールに沈んだ単語や知識が無意識につながっている可能性も否定できないので、やったことの事実としては書いておきます。

## SmartDBのガイドブック

製品の使い方が書いてあるガイドブックを見ながらSmartDBを触りました。

SmartDBはできることが多い反面、サイドメニューの項目の多さ等で心理的ハードルは高いですよね。

そこで、このガイドブック。

皆さんは始めて触るツールだと思いますし、BtoB製品なので利用シーンもパッとすぐには思いつき辛いと思います。
その点ガイドがあれば、自分で考えながら作らなくてもとりあえず書いてあることだけやれば動きますし、基本的なことは一人で作成できるようになります。

分からなかったり、実現したいことを思いついたりした場合には先輩にガンガンやり方を聞きましょう。

あるいはガイドそのものの分かりにくさを指摘するのも、会社にとって非常に価値あるものです。


## サポートサイト

業務の中で公式ドキュメントを読んだり、動画を観たりして理解を深めるのに使ってます。（進行形）

他社の製品でもそうですが、動画はIT素人の文系にとって非常にありがたいです。（少しでも自分の画面が動画と違うとテンパりますが。笑）

ドキュメントも問い合わせの担当になったらほぼ100%読むことになるので、今から心配しなくてもそのうち場所を覚えます。（そういう私もまだまだ使いこなせてないですが）

## Progate（有料。申請しても良いかも？）

とりあえずプログラミングとはどんなものか、を知るにはこれが一番良いと思います。

私はとりあえず HTML & CSS, Sass, JavaScript, React, Ruby, Ruby on Rails, Java, Command line, Git, SQL のコースをやりました。こう見ると結構やりましたね。（笑）

中でもRuby on Railsは全体像を理解するのに大変役に立ちました。

ソフトウェアを作って動かすのって、

1. プログラムを書く
2. それを実行するための動作確認の場（環境といいます）用意する
3. 実行して動かす

ということを自分でやらないといけません。

例えばHTMLファイルを書いて、それを保存し、そのファイルをブラウザで開くというようなことです。
（厳密にはHTMLはプログラミング言語ではありませんがイメージで）

これが普段なじみのあるブラウザくらいならまだ良いのですが、JavaやRubyなどの黒い画面を触るようなものも全て自分で用意するとなると初心者にはハードルが高いです。

その点Progateは動作環境を自分で用意しなくて良いため、とても取っつきやすいです。

上記で言う 2 と 3 はProgateが用意してくれていて、サイトから何かをダウンロードする必要すらありません。

キャラクターやデザインも今風でかわいくて、始める心理的ハードルが低いのも大きな魅力です。

ただ、逆にProgateが全部準備してくれちゃっているので、結局どうやってアプリが動いているのかよくわからなかったりします。

また、作りたいアプリのアイディアがある！とか、業務でコードに触れる！等が無いとやはりすぐに忘れてしまいますし、「文法は理解したけど、、、それで？」という状態になってしまうかもしれません。


そこで次の本。


## 『新人エンジニアのためのインフラ入門』

この本はインターネット上で動いているサービスの裏側がどうなっているかという全体像を解説してくれています。

Progateでも詳しく解説してくれていますが、こちらの方が俯瞰的な図で解説されていて、より詳しくイメージがつきやすいです。

SmartDBのようなサービスがどんな風に動いているかの概要はこの一冊でつかめると思います。

## すっきりわかるシリーズ

ここまでやればある程度全体像が見えてると思うのでSmartDBを作っているJavaやその周辺を学習していけば良いと思います。

- Java入門　←今ココ
- 実践編
- SQL
- サーブレット&JSP

実は私も現在「Java入門」を読んでいる途中です。（笑）
この本を見つけたのがつい先月で、もっと早くから知りたかったと若干後悔したくらい、分かり易いです。

そうは言っても、なんだかんだこれまで一年間少しずつ学んできた私にとってだからめちゃめちゃ分かり易いのかもしれませんし、一発目でいきなりこの本でもめちゃめちゃ分かり易いのかもしれませんし、何年たってもわかり辛いのかもしれません。要するに人それぞれです。

## 最後に

長くなりますが、文系出身で開発系の職種に就いた僕なりの「心構え」をお伝えしようと思います。

それは、

***文系と理系は前提としている知識が全く違う***

ということです。

「何をこの期に及んで当たり前のことを」と思われるでしょうし、まったくもって本当に当たり前のことなのですが、僕はこの事実に気が付くまで少し苦しみました。

もしかしたら僕だけがそんなことを思っていて、他の人からしたら「そんなこともわかってなかったのか…」と呆れられてしまうかもしれませんが誰かのためになることを願い、恥を忍んで共有します。

つまり、文系が理系世界に足を踏み入れるというのは、例えるならば**既に場が温まったパーティーに後から参加するのと同じ**だということです。

例えば...

> 訳あって1時間遅れで参加したパーティー。
>
> 自分が参加する前の1時間で内輪ネタが完全に出来上がってしまっていて、何が面白いのか全く分からないことに皆が爆笑している。
>
> そんな所に「ソイヤッ！」と鼻息荒く登場する自分。
>
> しかし、内輪ネタができた経緯やそれを使う文脈が分からない。楽しく談笑に参加しようにもしばらく様子見せざるを得ない。
>
> 遅れを取り返さなければ！と近くの人に聞いてみたり、あれこれ推察してみたりと*努力*してみるものの、周りの話題はどんどん進んでいく。。


当たり前ですが、最初からパーティーに参加していた人たちからすれば、その場で内輪ネタを共有するために**努力した**なんて微塵も思ってないはずですし、

キャッチアップするために「とりあえずさっき流行ってたギャグを習得しよう。。」と思って周りに聞いてみても、「そのギャグはもう古いぜ？」「今からやるならそれじゃなくてこっちでしょ」となってしまいます。

少し大げさかもしれませんが、アカデミアやIT技術の分野における専門用語や流行りとは要するに上記で言う「内輪ネタ」です。

皆さんもこんな経験はないでしょうか？（これから経験するかも？）

- グーグル先生おすすめの「初心者でも簡単！超入門！」と言うサイトを開いたら、なーんにも初心者向けじゃなくて愕然としたこと。

- 「基本情報1か月で合格！」の記事をもう半年くらい再訪している自分に嫌気がさしたこと。

- エンジニアの「全然難しくないよ」が超難しくて自信をなくしてしまったこと。

私はあります。（笑）

エンジニアの方々は「自分でもできたんだから簡単だよ」というような意味で優しい言葉を本気でかけてくださるのですが、文系はこの甘い言葉を真に受けてはいけません。

彼らは「パーティーに初めから参加している側の人たち」なのです。

私たちは後からやって来ました。

だから、皆から見たら非効率的だったり古くみえたりするようなことでも、自分にとってはその段階を経ることが必要である可能性は十分あり得ます。

何を前提に話しているかには気を付ける必要があるのです。

私もまだまだ修行中の身で、あまり偉そうなことを言うのも恐縮なのですが、この心構えは一般的に「人にわからないことを質問をする時」にも使えます。

自分は何を調べて、どこまでわかっていて、その上でどこが疑問点かということを初めに明確にしておかないと前提の共有ができずに齟齬が生まれてしまう可能性があります。

これでは相手の立場に立った聞き方ではなくなってしまいます。

なぜなら、特に回答してくれる人が親切であればあるほど、その齟齬をなくそうと前提のすり合わせから初めてくれるからです。

つまり、相手の時間を余計に頂戴することになってしまうのです。

日々のミスコミュニケーションは実はそんな些細なところから生まれて、ひいては大きな損失を生むことに繋がるかもしれません。

始めはそんなに深く考えずにバンバン質問したら良いと思うのですが、そんなことを意識して過ごすと少しずつ自分も会社も成長していくんじゃないかな、と皆さんにお伝えするふりして自分に言い聞かせて終わります。

長文読んでくださりありがとうございました。
